app/Controllers/Pendaftaran/AppointmentController.php

    public function getDoctorsByDept($deptId)
    {
        // Mengambil data dokter + nama dari tabel users berdasarkan poli
        $query = $this->db->table('doctors')
            ->select('doctors.doctor_id, users.full_name')
            ->join('users', 'users.user_id = doctors.user_id')
            ->where('doctors.department_id', $deptId)
            ->get();
---
SELECT `doctors`.`doctor_id`, `users`.`full_name`
FROM `doctors`
JOIN `users` ON `users`.`user_id` = `doctors`.`user_id`
WHERE `doctors`.`department_id` = '1'

    public function getSchedulesByDoctor($doctorId)
    {
        // Mengambil jadwal yang statusnya 'available'
        $query = $this->db->table('doctor_schedules')
            ->where('doctor_id', $doctorId)
            ->where('status', 'available')
            ->orderBy('day', 'ASC') // Urutkan hari
            ->get();
---
SELECT *
FROM `doctor_schedules`
WHERE `doctor_id` = '3'
AND `status` = 'available'
ORDER BY `day` ASC