app/Controllers/Pasien/Pasien.php

SELECT *
FROM `patients`
WHERE `user_id` = '15'
---
    private function getPatientId()
    {
        $userId = session()->get('user_id');

        if (!$userId) {
            return null;
        }

        $patient = $this->db->table('patients')
            ->where('user_id', $userId)
            ->get()
            ->getRow();

SELECT *
FROM `departments`
---
    public function booking()
    {
        $patientId = $this->getPatientId();

        if (!$patientId) {
            return redirect()->to('/');
        }

        $data['departments'] = $this->db
            ->table('departments')
            ->get()
            ->getResult();

SELECT `doctors`.`doctor_id`, `users`.`full_name`
FROM `doctors`
JOIN `users` ON `users`.`user_id` = `doctors`.`user_id`
WHERE `doctors`.`department_id` = '2'
---
    public function getDoctorsByDept($deptId)
    {
        $doctors = $this->db->table('doctors')
            ->select('doctors.doctor_id, users.full_name') // Ambil full_name dari tabel users
            ->join('users', 'users.user_id = doctors.user_id') // Gabungkan tabel doctors dan users
            ->where('doctors.department_id', $deptId)
            ->get()
            ->getResult();

SELECT *
FROM `doctor_schedules`
WHERE `doctor_id` = '3'
---
    public function getSchedulesByDoctor($doctorId)
    {
        // Pastikan nama tabel kamu 'doctor_schedules'
        $schedules = $this->db->table('doctor_schedules')
            ->where('doctor_id', $doctorId)
            ->get()
            ->getResult();